{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 400, 400, 3],
            "dtype": "float32",
            "sparse": false,
            "name": "input_layer"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d",
            "trainable": true,
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "valid",
            "activation": "relu"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d",
            "trainable": true,
            "pool_size": [2, 2],
            "strides": [2, 2],
            "padding": "valid"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "units": 128,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "predictions",
            "trainable": true,
            "units": 8,
            "activation": "softmax"
          }
        }
      ]
    }
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.0.0",
  "convertedBy": "TensorFlow.js Converter v4.0.0",
  "weightsManifest": [
    {
      "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"],
      "weights": [
        {
          "name": "conv2d/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [6272000, 128],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "predictions/kernel",
          "shape": [128, 8],
          "dtype": "float32"
        },
        {
          "name": "predictions/bias",
          "shape": [8],
          "dtype": "float32"
        }
      ]
    }
  ]
}